In [1]:
people = {
    "first": ["Onkar",'Yash','Shritej'],
    "Second": ["Galande",'Bangude','Kumbhar'],
    "Email": ["galandeonkar2001@gmail.com",'bangudeyash@gmail.com','kumbharshritya@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [7]:
df.sort_values(by='Second')

     first   Second                       Email
1     Yash  Bangude       bangudeyash@gmail.com
0    Onkar  Galande  galandeonkar2001@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [9]:
df.sort_values(by='Second', ascending=False)     #Descending order

     first   Second                       Email
2  Shritej  Kumbhar    kumbharshritya@gmail.com
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com

In [10]:
df.sort_values(by='Second', ascending=True)        #ascennding order

     first   Second                       Email
1     Yash  Bangude       bangudeyash@gmail.com
0    Onkar  Galande  galandeonkar2001@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [11]:
df.sort_values(by=['Second','first'] , ascending=False)

     first   Second                       Email
2  Shritej  Kumbhar    kumbharshritya@gmail.com
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com

In [13]:
df.sort_values(by=['Second','first'] , ascending=[False,True], inplace=True)

In [14]:
df

     first   Second                       Email
2  Shritej  Kumbhar    kumbharshritya@gmail.com
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com

In [15]:
df.sort_index()

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [16]:
df['first'].sort_values()

0      Onkar
2    Shritej
1       Yash
Name: first, dtype: object